Page({
  data: {
      listData: [
	  		["2021",0.85,0.95,1.25,1.1,0.91,0.7,0.56,0,0,0,0,0],
		["2020",1.1,0.5,0.88,1.18,1.2,0.88,0.72,0.87,1.1,0.62,0.6,0.63],
		["2019",1,0.9,1.12,1.26,1.24,1.2,1,0.95,1,1.15,1.25,1.2],
		["2018",0.8,0.78,0.8,1.05,0.8,0.78,0.68,0.62,0.86,0.92,0.86,1.1],
		["2017",0.9,0.64,0.62,0.78,0.8,0.55,0.65,0.8,0.82,1.08,0.81,0.81],
		["2016",1,1.08,1.32,1.38,1.32,1.24,1.17,0.7,0.62,7,0.8,0.9],
		["2015",0.88,0.6,0.95,1.18,0.78,0.68,0.62,0.62,1,1,0.9,1],
		["2014",0.45,0.60,0.95,1.33,1.4,1.1,0.8,0.6,0.8,0.9,0.88,1.1],

        ["2013",1.12,1.14,1.21,1.42,1.18,0.95,0.78,0.65,0.6,0.62,0.55,0.55]
      ]
  },
  onLoad: function () {
    var that = this;
    var filePath = "http://yungege.top:8000/chunlan.xls";//对应的网络路径，可以是内网的或者外网

    wx.downloadFile({//下载对应文件
      url: filePath,
      success: function (res) {

        var filePath = res.tempFilePath;//文件路径

        wx.openDocument({
          filePath: filePath,//装载对应文件的路径
          fileType: 'xls',//指定打开的文件类型
          success: function (res) {
            console.log("打开成功");
          },
          fail: function (res) {
            console.log(res);
          }
        })

      },
      fail: function (res) {
        console.log(res);
      }
    })


  },
})